## 1. Dataset Cleaning
- Clean and group the datasets as required

In [33]:
import numpy as np
import pandas as pd

### Combining the products and products-categories dataset

Since we have the products and the category of the products in 2 different datasets, we will combine them into 1 dataset to make it easier to reference

In [34]:
amazon_products = pd.read_csv('../raw_datasets/amazon_products.csv') 
amazon_products.head()

,id,title,price,category_id
0,13142,"Glitter Tulle Fabric Rolls, Gold Foil Star Tul...",9.99,7
1,46184,"Fabrics, Modern Scandinavian, Daffodil Pink Co...",7.30,7
2,48829,Urbun Baby Girls Headbands Wool Knitting Fabri...,8.99,35
3,8798,Spoonflower Fabric - Baby Blue White Swiss Cro...,12.00,7
4,33635,Cotton Computer Chips Circut Boards Technology...,14.95,7

In [35]:
amazon_categories = pd.read_csv('../raw_datasets/amazon_categories.csv')

def match_category(category_id):
  return amazon_categories[amazon_categories['id'] == category_id].iloc[0, 1]

amazon_products['category'] = amazon_products['category_id'].apply(match_category)

In [36]:
amazon_products = amazon_products.drop(columns=['category_id'])

In [37]:
amazon_products.head()

,id,title,price,category
0,13142,"Glitter Tulle Fabric Rolls, Gold Foil Star Tul...",9.99,Craft & Hobby Fabric
1,46184,"Fabrics, Modern Scandinavian, Daffodil Pink Co...",7.30,Craft & Hobby Fabric
2,48829,Urbun Baby Girls Headbands Wool Knitting Fabri...,8.99,Baby Care Products
3,8798,Spoonflower Fabric - Baby Blue White Swiss Cro...,12.00,Craft & Hobby Fabric
4,33635,Cotton Computer Chips Circut Boards Technology...,14.95,Craft & Hobby Fabric

### Dropping all unused rows

In [38]:
print(f'Before dropping values that are 0 in the prices column: {len(amazon_products)}')

amazon_products= amazon_products[amazon_products['price'] != 0]
print(f'After dropping values that are 0 in the prices column: {len(amazon_products)}')

Before dropping values that are 0 in the prices column: 758
After dropping values that are 0 in the prices column: 732

### Saving to CSV file

In [39]:
amazon_products.to_csv('./datasets/products.csv', index=False)

## Customer Dataset

This dataset has multiple columns showing the number of purchases from various places. We will combine all these values into a single column 'NumOfPurchases'

In [40]:
customers = pd.read_csv('../raw_datasets/customers.csv')
customers.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kids,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases
0,5524,1957,Graduation,Single,58138.0,0,3,8,10,4
1,2174,1954,Graduation,Single,46344.0,2,2,1,1,2
2,4141,1965,Graduation,Together,71613.0,0,1,8,2,10
3,6182,1984,Graduation,Together,26646.0,1,2,2,0,4
4,5324,1981,PhD,Married,58293.0,1,5,5,3,6

In [41]:
customers['NumOfPurchases'] = customers['NumDealsPurchases'] + customers['NumWebPurchases'] + customers['NumCatalogPurchases'] + customers['NumStorePurchases']

Convert "Year_Birth" column into "Age" column

In [42]:
customers['Age'] = 2024 - customers['Year_Birth']

Dropping all unused columns

In [43]:
customers = customers.drop(columns=['Year_Birth', 'NumDealsPurchases', 'NumWebPurchases', 'NumCatalogPurchases', 'NumStorePurchases'])

Next we will add 2 products that they 'bought' to each customer

In [44]:
from random import choice

product_id_list = list(amazon_products['id'])

# create empty columns
customers['Product_1'] = [choice(product_id_list) for _ in range(len(customers))]
customers['Product_2'] = [choice(product_id_list) for _ in range(len(customers))]

In [45]:
print(f'Before dropping NaN values: {len(customers)}')

customers = customers.dropna()
print(f'After dropping NaN values: {len(customers)}')

Before dropping NaN values: 2240
After dropping NaN values: 2216

In [46]:
customers.head()

,ID,Education,Marital_Status,Income,Kids,NumOfPurchases,Age,Product_1,Product_2
0,5524,Graduation,Single,58138.0,0,25,67,22896,41731
1,2174,Graduation,Single,46344.0,2,6,70,19442,19053
2,4141,Graduation,Together,71613.0,0,21,59,22868,34901
3,6182,Graduation,Together,26646.0,1,8,40,15856,45888
4,5324,PhD,Married,58293.0,1,19,43,2772,33379

In [47]:
customers.to_csv('datasets/customers.csv', index=False)